# StairsDesiredNumRisers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDesiredNumRisers Property
ParameterTypeId Class See Also
---
"Desired Number of Risers"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDesiredNumRisers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDesiredNumRisers As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDesiredNumRisers {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace